/***************************************************************************
 *   Copyright (C) 2008-2019 by Oleksii S. Malakhov <brezerk@gmail.com>    *
 *                                                                         *
 *   This program is free software: you can redistribute it and/or modify  *
 *   it under the terms of the GNU General Public License as published by  *
 *   the Free Software Foundation, either version 3 of the License, or     *
 *   (at your option) any later version.                                   *
 *                                                                         *
 *   This program is distributed in the hope that it will be useful,       *
 *   but WITHOUT ANY WARRANTY; without even the implied warranty of        *
 *   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the         *
 *   GNU General Public License for more details.                          *
 *                                                                         *
 *   You should have received a copy of the GNU General Public License     *
 *   along with this program.  If not, see <http://www.gnu.org/licenses/>. *
 *                                                                         *
 ***************************************************************************/
 
 /*
Briefing script
*/

player createDiaryRecord ["Diary", [ "Додаткове Завдання",  "Розвідати вогневі позиції за координатами 014:058"]];
player createDiaryRecord ["Diary", [ "Додаткове Завдання",  "Знайти і знищіти контрбатарейну РЛС"]];
player createDiaryRecord ["Diary", [ "Завдання",  "Знайти і знищіти батарею реактивної системи залпового вогню БМ-21 (9К51)"]];
player createDiaryRecord ["Diary", ["-------------", ""]];
player createDiaryRecord ["Diary", [ "Дія II",  "Відступивши до лісу, ви отримали короткострокову перерву на відпочинок. Судячи з активності артилерії, ситуація на всьому фронті почала виходити з під контролю, часу вже майже не має."]];
player createDiaryRecord ["Diary", [ "Дія I",  "За отриманими даними, вдалося ідентифікувати базу контрабандистів. Проте, вогнева група попала в засідку і понесла важкі втрати. При підтримці резервів, та виділеного БТР, вдалося ліквідувати супротив, отримати нові данні та знищити схованку з боєприпасами. Група вдало перетнула першу лінію фронту та взяла штурмом операційну базу супротивника: знищивши їх командира та радіовежу."]];
player createDiaryRecord ["Diary", [ "Зав'язка",  "Днями на північному напрямку проведення операції Об'єднаних сил спецпризначенці проводили заходи зі здобуття розвідувальної інформації. І несподівано помітили, що з боку противника до них наближаються диверсійно-розвідувальна група. Командиром було прийнято рішення вступити у вогневий контакт. За результатами контакту: ДРГ супротивника було знищено. Одного пораненого захоплено у полон."]];
player createDiaryRecord ["Diary", ["-------------", ""]];
player createDiaryRecord ["Diary", [ "Ситуація",  "Упродовж доби, що минула, російсько-окупаційні війська 22 рази порушили режим припинення вогню. Противник обстрілював наші позиції із заборонених Мінськими домовленостями артилерійських систем калібру 152 мм та 122 мм, мінометів калібру 120 мм та 82 мм, озброєння танку і БМП, а також гранатометів різних систем, великокаліберних кулеметів та стрілецької зброї. Підкреслюємо, що поблизу населеного пункту Cумма ворог здійснив спробу штурму наших спостережних постів. Під час бойового зіткнення воїни Об’єднаних сил подавили ворожий вогонь та зупинили диверсійно-розвідувальну групу противника, не допустивши втрати позицій."]];


