/***************************************************************************
 *   Copyright (C) 2008-2019 by Oleksii S. Malakhov <brezerk@gmail.com>    *
 *                                                                         *
 *   This program is free software: you can redistribute it and/or modify  *
 *   it under the terms of the GNU General Public License as published by  *
 *   the Free Software Foundation, either version 3 of the License, or     *
 *   (at your option) any later version.                                   *
 *                                                                         *
 *   This program is distributed in the hope that it will be useful,       *
 *   but WITHOUT ANY WARRANTY; without even the implied warranty of        *
 *   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the         *
 *   GNU General Public License for more details.                          *
 *                                                                         *
 *   You should have received a copy of the GNU General Public License     *
 *   along with this program.  If not, see <http://www.gnu.org/licenses/>. *
 *                                                                         *
 ***************************************************************************/
 
 /*
Briefing script
*/

player createDiaryRecord ["Diary", [ "Додаткове Завдання",  "Пошук припасів на колишніх військових базах."]];
player createDiaryRecord ["Diary", [ "Завдання",  "Але, незвичайні явища на цьому не зупинились. З часом, в околицях поселення, почали помічати страшних істот. Прокляття генератора? Можливо, але і інші віддалені табори тепер повідомляють те саме. Подорожі між поселеннями стали надзвичайно небезпечні і транспортне сполучення майже зупинилось. Це спровокувало нестачу припасів і голод. Почалась нескінченна злива, а зі сходу насувається нечувана буря. Старійшини поселення, вирішили спорядити експедицію в покинуте місто Братов. Ваше завдання: розвідати ключові точки міста та знайти припаси."]];
player createDiaryRecord ["Diary", [ "Результати дії II",  "Діставшись електростанції, та знайшовши генератори, група спробувала вивести ці артефакти минулих часів. Через страшні втрати, лише одна машина з трьох дісталась цілі."]];
player createDiaryRecord ["Diary", [ "Результати дії I",  "Хоча експедиційна група і дісталася своєї мети, старої електростанції в Електрозаводську, а також змогла впоратись з  могутньою аномалією, ціна була надто велика: втрати в техніці, обладнанні, боєприпасах і живий силі -- ставлять всю експедицію під загрозу. Стає очевидним, що страхітливі і відразливі створіння та неосяжні розумом аномалії, які створив Новий Світ, відтепер є безроздільними власниками Східних земель Чернорусії. Ніхто і ніщо інше не зможе вижити тут."]];
player createDiaryRecord ["Diary", [ "Зав'язка",  "Ваша банда вижила, і стала контролювати західні території Чернорусії, збільшуючи свою численність і могутність. Спрага до нових ресурсів змусила відправити експедиційну групу на схід."]];
player createDiaryRecord ["Diary", ["-------------", ""]];
player createDiaryRecord ["Diary", [ "Ситуація",  "2071 рік. Світ який ви знали загинув багато років тому. Після техногенної катастрофи, що забрала життя більшої частини населення розпочалась остання світова війна за їжу, воду та залишки ресурсів. В своїй агонії вцілілі держави пустили в хід все що в них лишилось: армію, авіацію, флот, бомби, біологічну та ядерну зброю. Вціліли об'єднувались у зграї та банди, забезпечуючи собі виживання у цьому новому страхітливому світі."]];


